simulations/hydropower/of_interFoam/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    side_wall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    bottom_wall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    top_wall
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }

    defaultFaces
    {
        type            empty;
    }
}
