simulations/hydropower/of_interFoam/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.14;             
        value           uniform 1e-4;
    }
    side_wall
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }

    bottom_wall
    {
        type            epsilonWallFunction;
        value           uniform 1e-4;
    }

    top_wall
    {
        type            inletOutlet;
        inletValue      uniform 0.;
        value           uniform 0.;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //

